Samples/Output/net10.0/mmd/diagramgeneratorsample.mmd
flowchart LR
  diagramgeneratorsample["DiagramGeneratorSample"]
  microsoft-extensions-configuration_10-0-8["Microsoft.Extensions.Configuration<br>v10.0.8"]
  microsoft-extensions-configuration-abstractions_10-0-8["Microsoft.Extensions.Configuration.Abstractions<br>v10.0.8"]
  microsoft-extensions-primitives_10-0-8["Microsoft.Extensions.Primitives<br>v10.0.8"]
  microsoft-extensions-configuration-binder_10-0-8["Microsoft.Extensions.Configuration.Binder<br>v10.0.8"]
  microsoft-extensions-configuration-json_10-0-8["Microsoft.Extensions.Configuration.Json<br>v10.0.8"]
  microsoft-extensions-configuration-fileextensions_10-0-8["Microsoft.Extensions.Configuration.FileExtensions<br>v10.0.8"]
  microsoft-extensions-fileproviders-abstractions_10-0-8["Microsoft.Extensions.FileProviders.Abstractions<br>v10.0.8"]
  microsoft-extensions-fileproviders-physical_10-0-8["Microsoft.Extensions.FileProviders.Physical<br>v10.0.8"]
  slndependencydiagramgenerator["SlnDependencyDiagramGenerator"]
  alloverit_9-2-1["AllOverIt<br>v9.2.1"]
  alloverit-assertion_9-2-1["AllOverIt.Assertion<br>v9.2.1"]
  alloverit-validation_9-2-1["AllOverIt.Validation<br>v9.2.1"]
  fluentvalidation_12-1-1["FluentValidation<br>v12.1.1"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-8["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.8"]
  microsoft-build-locator_1-11-2["Microsoft.Build.Locator<br>v1.11.2"]
  nuget-frameworks_7-6-0["NuGet.Frameworks<br>v7.6.0"]
  nuget-projectmodel_7-6-0["NuGet.ProjectModel<br>v7.6.0"]
  nuget-dependencyresolver-core_7-6-0["NuGet.DependencyResolver.Core<br>v7.6.0"]
  nuget-configuration_7-6-0["NuGet.Configuration<br>v7.6.0"]
  nuget-librarymodel_7-6-0["NuGet.LibraryModel<br>v7.6.0"]
  nuget-protocol_7-6-0["NuGet.Protocol<br>v7.6.0"]
  nuget-packaging_7-6-0["NuGet.Packaging<br>v7.6.0"]
  newtonsoft-json_13-0-3["Newtonsoft.Json<br>v13.0.3"]
  nuget-versioning_7-6-0["NuGet.Versioning<br>v7.6.0"]
  system-security-cryptography-pkcs_8-0-1["System.Security.Cryptography.Pkcs<br>v8.0.1"]
  diagramgeneratorsample --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  microsoft-extensions-configuration-abstractions_10-0-8 --> microsoft-extensions-primitives_10-0-8
  microsoft-extensions-configuration_10-0-8 --> microsoft-extensions-primitives_10-0-8
  diagramgeneratorsample --> microsoft-extensions-configuration-binder_10-0-8
  microsoft-extensions-configuration-binder_10-0-8 --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration-binder_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  diagramgeneratorsample --> microsoft-extensions-configuration-json_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-configuration-fileextensions_10-0-8
  microsoft-extensions-configuration-fileextensions_10-0-8 --> microsoft-extensions-configuration_10-0-8
  microsoft-extensions-configuration-fileextensions_10-0-8 --> microsoft-extensions-configuration-abstractions_10-0-8
  microsoft-extensions-configuration-fileextensions_10-0-8 --> microsoft-extensions-fileproviders-abstractions_10-0-8
  microsoft-extensions-configuration-fileextensions_10-0-8 --> microsoft-extensions-fileproviders-physical_10-0-8
  microsoft-extensions-configuration-fileextensions_10-0-8 --> microsoft-extensions-primitives_10-0-8
  microsoft-extensions-configuration-json_10-0-8 --> microsoft-extensions-fileproviders-abstractions_10-0-8
  microsoft-extensions-fileproviders-abstractions_10-0-8 --> microsoft-extensions-primitives_10-0-8
  diagramgeneratorsample --> slndependencydiagramgenerator
  slndependencydiagramgenerator --> alloverit_9-2-1
  alloverit_9-2-1 --> alloverit-assertion_9-2-1
  slndependencydiagramgenerator --> alloverit-validation_9-2-1
  alloverit-validation_9-2-1 --> alloverit_9-2-1
  alloverit-validation_9-2-1 --> fluentvalidation_12-1-1
  alloverit-validation_9-2-1 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  slndependencydiagramgenerator --> microsoft-build-locator_1-11-2
  slndependencydiagramgenerator --> nuget-frameworks_7-6-0
  slndependencydiagramgenerator --> nuget-projectmodel_7-6-0
  nuget-projectmodel_7-6-0 --> nuget-dependencyresolver-core_7-6-0
  nuget-dependencyresolver-core_7-6-0 --> nuget-configuration_7-6-0
  nuget-dependencyresolver-core_7-6-0 --> nuget-librarymodel_7-6-0
  nuget-dependencyresolver-core_7-6-0 --> nuget-protocol_7-6-0
  slndependencydiagramgenerator --> nuget-protocol_7-6-0
  nuget-protocol_7-6-0 --> nuget-packaging_7-6-0
  nuget-packaging_7-6-0 --> newtonsoft-json_13-0-3
  nuget-packaging_7-6-0 --> nuget-configuration_7-6-0
  nuget-packaging_7-6-0 --> nuget-versioning_7-6-0
  nuget-packaging_7-6-0 --> system-security-cryptography-pkcs_8-0-1
  style microsoft-extensions-configuration_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-primitives_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-configuration-binder_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-json_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-configuration-fileextensions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-fileproviders-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-fileproviders-physical_10-0-8 fill:#FFEC96,opacity:0.8
  style alloverit_9-2-1 fill:#ADD8E6,opacity:0.8
  style alloverit-assertion_9-2-1 fill:#FFEC96,opacity:0.8
  style alloverit-validation_9-2-1 fill:#ADD8E6,opacity:0.8
  style fluentvalidation_12-1-1 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style microsoft-build-locator_1-11-2 fill:#ADD8E6,opacity:0.8
  style nuget-frameworks_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-projectmodel_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-dependencyresolver-core_7-6-0 fill:#FFEC96,opacity:0.8
  style nuget-configuration_7-6-0 fill:#FFEC96,opacity:0.8
  style nuget-librarymodel_7-6-0 fill:#FFEC96,opacity:0.8
  style nuget-protocol_7-6-0 fill:#ADD8E6,opacity:0.8
  style nuget-packaging_7-6-0 fill:#FFEC96,opacity:0.8
  style newtonsoft-json_13-0-3 fill:#FFEC96,opacity:0.8
  style nuget-versioning_7-6-0 fill:#FFEC96,opacity:0.8
  style system-security-cryptography-pkcs_8-0-1 fill:#FFEC96,opacity:0.8
